lambda/src/test/resources/Migrations/Membership2023/Batch3/GBP/subscription.json

{
  "success" : true,
  "id" : "8a129a6385cd03d80185cdd67d041148",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "A00338958",
  "accountName" : "ACCOUNT-NAME",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "A00338958",
  "invoiceOwnerAccountName" : "ACCOUNT-NAME",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 7,
  "revision" : "7.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2017-01-20",
  "serviceActivationDate" : "2017-01-20",
  "customerAcceptanceDate" : "2017-01-20",
  "subscriptionStartDate" : "2017-01-20",
  "subscriptionEndDate" : "2024-01-20",
  "lastBookingDate" : "2023-01-20",
  "termStartDate" : "2023-01-20",
  "termEndDate" : "2024-01-20",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 4.08,
  "totalContractedValue" : 343.00,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : null,
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : null,
  "ActivationDate__c" : null,
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : "GB",
  "PromotionCode__c" : null,
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a129a6385cd03d80185cdd67d0c114a",
    "productId" : "2c92a0fb4bb97034014bbbc561fa4fed",
    "productName" : "Supporter",
    "productSku" : "SKU-00000013",
    "productRatePlanId" : "2c92a0fb4c5481db014c69f4a1e03bbd",
    "ratePlanName" : "Non Founder Supporter - annual",
    "ratePlanCharges" : [ {
      "id" : "8a129a6385cd03d80185cdd67d11114c",
      "originalChargeId" : "2c92a0fe59b55c3c0159bc5b148e7798",
      "productRatePlanChargeId" : "2c92a0fb4c5481db014c69f4a2013bbf",
      "number" : "C-00821078",
      "name" : "Supporter Membership - Annual",
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 7,
      "pricingSummary" : "GBP49",
      "priceChangeOption" : "UseLatestProductCatalogPricing",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "price" : 49.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2017-01-20",
      "effectiveEndDate" : "2024-01-20",
      "processedThroughDate" : "2023-01-20",
      "chargedThroughDate" : "2024-01-20",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "ContractEffective",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 4.083333333,
      "dmrc" : 0.000000000,
      "tcv" : 343.000000000,
      "dtcv" : 49.000000000,
      "originalOrderDate" : "2017-01-20",
      "amendedByOrderOn" : "2023-01-20",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    } ],
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null
  } ],
  "orderNumber" : "O-00129772",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2017-01-20",
    "endDate" : "2024-01-20",
    "status" : "Active"
  }, {
    "startDate" : "2024-01-20",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}